nightcatccc/STM32F4-car/2300310332 - 副本/hardware/usart/Serial3.c
#include "stm32f4xx.h"                  // Device header
                // Device header
#include <stdio.h>
#include <stdarg.h>

uint8_t Serial_RxFlag3;
/**
  * ?    ?:?????
  * ?    ?:?  
  * ? ? ?:?
  */
void Serial_Init3(void)
{
	 //GPIO????
    GPIO_InitTypeDef GPIO_InitStructure;
	USART_InitTypeDef USART_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;
	
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB,ENABLE); //??GPIOA??
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3,ENABLE);//??USART1??
 
	//??1????????
	GPIO_PinAFConfig(GPIOB,GPIO_PinSource10,GPIO_AF_USART3); //GPIOA9???USART1
	GPIO_PinAFConfig(GPIOB,GPIO_PinSource11,GPIO_AF_USART3); //GPIOA10???USART1
	
	//USART1????
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11; //GPIOA9?GPIOA10
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;//????
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;	//??50MHz
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP; //??????
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP; //??
	GPIO_Init(GPIOB,&GPIO_InitStructure); //???PA9,PA10

   //USART1 ?????
	USART_InitStructure.USART_BaudRate = 9600;//?????
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;//???8?????
	USART_InitStructure.USART_StopBits = USART_StopBits_1;//?????
	USART_InitStructure.USART_Parity = USART_Parity_No;//??????
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;//????????
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;	//????
	USART_Init(USART3, &USART_InitStructure); //?????1
	

	USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);//??????

	//Usart1 NVIC ??
	NVIC_InitStructure.NVIC_IRQChannel = USART3_IRQn;//??1????
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority=3;//?????3
	NVIC_InitStructure.NVIC_IRQChannelSubPriority =3;		//????3
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;			//IRQ????
	NVIC_Init(&NVIC_InitStructure);	//??????????VIC????

	USART_Cmd(USART3, ENABLE);  //????1 



}

/**
  * ?    ?:????????
  * ?    ?:Byte ????????
  * ? ? ?:?
  */
void Serial_SendByte3(uint8_t Byte)
{
	
	USART_SendData(USART3, Byte);		//????????????,???USART????????
	while (USART_GetFlagStatus(USART3, USART_FLAG_TXE) == RESET);	//??????
	/*?????????????????????,?????,???????*/
}

/**
  * ?    ?:????????
  * ?    ?:Array ?????????
  * ?    ?:Length ????????
  * ? ? ?:?
  */
void Serial_SendArray3(uint8_t *Array, uint16_t Length)
{
	uint16_t i;
	for (i = 0; i < Length; i ++)		//????
	{		
		 Serial_SendByte3(Array[i]);
	}
}

/**
  * ?    ?:?????????
  * ?    ?:String ??????????
  * ? ? ?:?
  */
void Serial_SendString3(char *String)
{
	uint8_t i;
	for (i = 0; String[i] != '\0'; i ++)//??????(???),?????????????
	{
		Serial_SendByte3(String[i]);		//????Serial_SendByte????????
	}
}

/**
  * ?    ?:????(????)
  * ? ? ?:?????X?Y??
  */
uint32_t Serial_Pow3(uint32_t X, uint32_t Y)
{
	uint32_t Result = 1;	//???????1
	while (Y --)			//??Y?
	{
		Result *= X;		//?X?????
	}
	return Result;
}

/**
  * ?    ?:??????
  * ?    ?:Number ??????,??:0~4294967295
  * ?    ?:Length ????????,??:0~10
  * ? ? ?:?
  */


/**
  * ?    ?:??printf??????????
  * ?    ?:????????,????
  * ? ? ?:????????,????
  */
//int fputc(int ch, FILE *f)
//{
//	Serial_SendByte1(ch);			//?printf????????????????
//	return ch;
//}
//int fputc(int ch,FILE *p)  //?????,???printf???????
//{
//	USART_SendData(USART1,(u8)ch);	
//	while(USART_GetFlagStatus(USART1,USART_FLAG_TXE)==RESET);
//	return ch;
//}

///**
//  * ?    ?:?????prinf??
//  * ?    ?:format ??????
//  * ?    ?:... ???????
//  * ? ? ?:?
//  */
//void Serial_Printf(char *format, ...)
//{
//	char String[100];				//??????
//	va_list arg;					//???????????????arg
//	va_start(arg, format);			//?format??,???????arg??
//	vsprintf(String, format, arg);	//??vsprintf???????????????????
//	va_end(arg);					//????arg
//	Serial_SendString1(String);		//????????(???)
//}

/**
  * ?    ?:???????
  * ?    ?:?
  * ? ? ?:?
  * ?    ?:??????,Serial_TxPacket??????????(FF)??(FE)?,?????????
  */
void Serial_SendPacket3(void)
{
	;	
}

/**
  * ?    ?:????????????
  * ?    ?:?
  * ? ? ?:??????????,??:0~1,???????,????1,??????????
  */
uint8_t Serial_GetRxFlag3(void)
{
	if (Serial_RxFlag3 == 1)			//??????1
	{
		Serial_RxFlag3 = 0;
		return 1;					//???1,????????
	}
	return 0;						//??????0,???0
}
uint8_t RxData3;
/**
  * ?    ?:USART1????
  * ?    ?:?
  * ? ? ?:?
  * ????:????????,????,?????????
  *           ???????????,?????????
  *           ????????,???????,???????????
  */
void USART3_IRQHandler(void)
{

	if (USART_GetITStatus(USART3, USART_IT_RXNE) == SET)		//?????USART1??????????
	{
		RxData3 = USART_ReceiveData(USART3);				//???????,??????????
		USART_ClearITPendingBit(USART3, USART_IT_RXNE);		//?????
		Serial_RxFlag3=1;
	}

}
